# Pivoting

Need three keys to use from your dataframe. The `index` and `columns` keys will be 'zipped' together to form `(x,y)` pairs and then the ` values` key is the function value associated to `(x,y)`.

Things you need to make this happen is that:
- The `index` and `columns` columns must form a set of unique pairs. They have to have the same number of

In [1]:
import pandas as pd

In [9]:
df = pd.DataFrame(data={
    'column1': ['A', 'B', 'C', 'D'],
    'column2': [1, 2, 1, 2],
    'column3': ['X', 'X', 'Y', 'Y']
})

In [10]:
df

  column1  column2 column3
0       A        1       X
1       B        2       X
2       C        1       Y
3       D        2       Y

In [11]:
df.pivot(index='column2', columns='column3', values='column1')

column3  X  Y
column2
1        A  C
2        B  D

In [12]:
df.pivot(index='column3', columns='column2', values='column1')

column2  1  2
column3
X        A  B
Y        C  D

In [18]:
# An example that still has same number of unique values in `index` and `columns` fields
# but not every pair of those unique values has an associated `values` entry

df = pd.DataFrame(data={
    'column1': ['A', 'B', 'C', 'D'],
    'column2': [1, 2, 3, 4],
    'column3': ['X', 'Y', 'Z', 'A']
})

print(df)
print("=====")
print(df.pivot(index='column3', columns='column2', values='column1'))

  column1  column2 column3
0       A        1       X
1       B        2       Y
2       C        3       Z
3       D        4       A
=====
column2    1    2    3    4
column3
A        NaN  NaN  NaN    D
X          A  NaN  NaN  NaN
Y        NaN    B  NaN  NaN
Z        NaN  NaN    C  NaN